Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོས་རློམ་སེམས་སུ་བྱེད་ཅིང་གཟུངས་ཀྱི་སྒོར་དམིགས་སོ།
en: They give rise to conceits about the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways and then apprehend the dhāraṇī gateways [and so forth].

source: །སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱིས་རློམ་སེམས་སུ་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པར་དམིགས་སོ།
en: They give rise to conceits about the ten powers [of the tathāgatas], the four fearlessnesses, the four kinds of exact knowledge, and the distinct qualities of the buddhas and then apprehend the distinct qualities of the buddhas [and so forth].

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་གྱིས་རློམ་སེམས་སུ་བྱེད་ཅིང་།
en: They give rise to conceits about [the goals], up to and including unsurpassed, complete enlightenment, and then apprehend [the goals], up to and including unsurpassed, complete enlightenment. “

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་དམིགས་ཏེ། དེ་འདི་སྙམ་དུ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ།
en: Then they think, ‘I shall attain consummate buddhahood in unsurpassed, complete enlightenment!

source: །བདག་གིས་སེམས་ཅན་རྣམས་འཁོར་བ་ནས་དགྲོལ་བར་བྱའོ་སྙམ་དུ་སེམས་ཤིང་།
en: I shall liberate beings from cyclic existence!’

source: དེ་འདི་ལྟར་ཡང་དག་པ་མ་ཡིན་པར་རྣམ་པར་རྟོག་གོ །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: And so they imagine that which is incorrect.

source: རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྟོང་པ་ཉིད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དང་། འཕགས་པའི་བདེན་པ་དང་། ཏིང་ངེ་འཛིན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་།
en: If you ask why, Subhūti, although physical forms, feelings, perceptions, formative predispositions, consciousness, the sense fields, the sensory elements, the links of dependent origination, the perfections, the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, {Ki.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི། སངས་རྒྱས་རྣམས་ཀྱི་སྤྱན་ལྔས་ཀྱང་མ་དམིགས་ན། སྐྱེས་བུ་གླེན་པ་ལོང་བ་མིག་མེད་པ་དེ་དག་ནི་སེམས་ཅན་རྣམས་འཁོར་བ་ནས་དགྲོལ་བར་འདོད་དོ། །གསོལ་པ།
en: V: 120} signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and unsurpassed, complete enlightenment are not apprehended even by the five eyes of the buddhas, those dim-witted persons who are blind and without eyes wish to liberate beings from cyclic existence.” “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་སྤྱན་ལྔས་ཀྱང་། སེམས་ཅན་གང་འཁོར་བ་ལས་ཡོངས་སུ་དགྲོལ་བར་བགྱི་བ་དེ་ལྟ་བུ་མ་གཟིགས་ན། བཅོམ་ལྡན་འདས་འོ་ན་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཡང་དག་པར་ངེས་པ་དང་། མ་ངེས་པ་དང་། ལོག་པར་ངེས་པའི་ཕུང་པོ་གསུམ་དུ་ལུང་བསྟན་པ་མཛད།
en: Blessed Lord, if even with their five kinds of eye the tathāgatas, arhats, completely awakened buddhas do not see those beings whom they would liberate from cyclic existence, how then, Blessed Lord, does the Blessed One, having attained consummate buddhahood in unsurpassed, complete enlightenment, then prophesy which beings belong to the three categories of certain, uncertain, or contrary destiny?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ངས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཡང་དག་པར་ངེས་པ་དང་། མ་ངེས་པ་དང་། ལོག་པར་ངེས་པའི་སེམས་ཅན་གང་ཡང་མི་དམིགས་ཏེ།
en: Subhūti,” replied the Blessed One, “having attained consummate buddhahood in unsurpassed, complete enlightenment, I do not apprehend any beings at all who belong to the three categories of those whose receptivity is certain, those whose receptivity is unpredictable, or those whose nonreceptivity is certain.

source: རབ་འབྱོར་འོན་ཀྱང་སེམས་ཅན་དངོས་པོ་མེད་པ་ལ། དངོས་པོར་འདུ་ཤེས་པ་དེ་དག་ཡང་དག་པ་མ་ཡིན་པར་འཛིན་པ་ལས་གདོན་པ་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུའི། དོན་དམ་པར་ནི་མ་ཡིན་ནོ། །གསོལ་པ།
en: On the other hand, Subhūti, in mundane, conventional terms, though not ultimately, I do indeed extricate those beings who perceive nonentities as entities from grasping inauthentic states.” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དམ་པ་ལ་ཞུགས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སམ།
en: Did the Blessed One then attain consummate buddhahood in unsurpassed, complete enlightenment after entering into ultimate reality?” “

source: འོ་ན་ཕྱིན་ཅི་ལོག་ལ་ཞུགས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སམ།
en: In that case, did the Blessed One attain consummate buddhahood in unsurpassed, complete enlightenment after entering into mistaken [ways]?” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་དོན་དམ་པ་ལ་ཞུགས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ཡང་མ་ལགས་ལ། ཕྱིན་ཅི་ལོག་ལ་ཞུགས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ཡང་མ་ལགས་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་འམ།
en: Blessed Lord, if they do not attain consummate buddhahood in unsurpassed, complete enlightenment after entering into ultimate reality, and they do not attain consummate buddhahood in unsurpassed, complete enlightenment after entering into mistaken [ways], in that case, Blessed Lord, do the tathāgatas attain consummate buddhahood in unsurpassed, complete enlightenment?

source: གཅིག་ཏུ་མི་འགྱུར་རམ།
en: Are these not identical?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེ་ཡང་འདུས་བྱས་ཀྱི་ཁམས་སམ་འདུས་མ་བྱས་ཀྱི་ཁམས་གང་ལ་ཡང་གནས་ཏེ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ནི་འདུས་བྱས་ཀྱི་ཁམས་སམ། འདུས་མ་བྱས་ཀྱི་ཁམས་གང་ལ་ཡང་གནས་པ་མ་ཡིན་ཏེ། འོན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་དེ་ནི་འགྲོ་ཞིང་འོང་བ་དང་གནས་ཤིང་འདུག་པ་ཡང་ཡོད་དོ། །དེས་གལ་ཏེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད།
en: The Blessed One replied, “The tathāgatas, arhats, completely awakened buddhas do attain consummate buddhahood in unsurpassed, complete enlightenment, but they do not attain consummate buddhahood while established in any conditioned elements or unconditioned elements.

source: ནང་སྟོང་པ་ཉིད་ལ་སྤྱད། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱད། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་བསྒོམས། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་བསྒོམས། འཕགས་པའི་བདེན་པ་བཞི་ལ་བསྒོམས། བསམ་གཏན་བཞི་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོ
en: Subhūti, just as an emanation of the tathāgatas is not established in any conditioned elements or unconditioned elements, but that emanation of the tathāgatas indeed goes and comes, stands and sits, and if it were to practice the perfection of generosity; practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; practice the emptiness of internal phenomena; practice [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; cultivate the four applications of mindfulness; cultivate the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path; cultivate the four truths of the noble ones; attain and maintain the four meditative concentrations; attain and maintain the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the meditative stability of emptiness, the meditative stability of signlessness, {Ki.

source: མས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་མངོན་པར་བསྒྲུབས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བསྒོམས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ལ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ། དེ་ལྟར་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས། སེམས་ཅན་ཚད་མེད་དཔག་ཏུ་མེད་པ་མངོན་པར་སྤྲུལ་ཏེ། ཕུང་པོ་གསུམ་དུ་ལུང་བསྟན་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སྤྲུལ་པ་དེས་སེམས་ཅན་གང་ཡང་ཕུང་པོར་བྱས་པ་ཡོད་དམ།
en: V: 121} and the meditative stability of wishlessness; actualize the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; and cultivate the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas; and if it were then to attain consummate buddhahood in unsurpassed, complete enlightenment, and after attaining consummate buddhahood in unsurpassed, complete enlightenment, turn the wheel of the Dharma, and after turning the wheel of the Dharma, emanate an inestimable number of beings and prophesy which will belong to the three categories, do you think, Subhūti, that that emanation would have prophesied any beings at all to belong to these categories?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུར་མཁྱེན་ཅིང་ཐུགས་སུ་ཆུད་དེ།
en: In the same way, Subhūti,” continued the Blessed One, “the tathāgatas know and understand all phenomena to be like an emanation.

source: སྤྲུལ་པ་ལྟ་བུར་མཁྱེན་ནས། སེམས་ཅན་གང་ཡང་དམིགས་པ་མེད་དོ། །བཏུལ་བ་མེད་དོ།
en: Knowing them to resemble an emanation, they do not apprehend and have not disciplined any beings at all.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ། །གསོལ་པ།
en: So it is, Subhūti, that bodhisattva great beings should practice the perfection of wisdom, in the manner of an emanation of the tathāgatas.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུ་ལགས་ན། དེ་བཞིན་གཤེགས་པ་དང་། སྤྲུལ་པ་ལ་ཁྱད་པར་དང་། བྱེ་བྲག་ཅི་ཞིག་མཆིས།
en: Blessed Lord, if all phenomena are like an emanation, what is the distinction and the difference between the tathāgatas and their emanations?

source: ཅི་ལས་དགོངས་པ་ལགས།
en: What is the source of the enlightened intention?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དང་། སྤྲུལ་པ་ལ་ཁྱད་པར་དང་བྱེ་བྲག་གང་ཡང་མི་དམིགས་ཏེ།
en: Subhūti,” replied the Blessed One, “no distinction or difference at all is apprehended between the tathāgatas and their emanations.

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དང་སྤྲུལ་པ་ལ་ནི་ཁྱད་པར་མེད་དོ།
en: Subhūti, the tathāgatas and their emanations are without distinction.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཕྲིན་ལས་གང་མཛད་པའི་ལས་དེ་ནི་སྤྲུལ་པ་ཡང་བྱེད་དོ། །གསོལ་པ།
en: If you ask why, Subhūti, it is because emanations also perform those activities that the tathāgatas perform.” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། དེ་བཞིན་གཤེགས་པ་མི་བཞུགས་ན།
en: Blessed Lord, is it when the tathāgatas are not present that their emanations perform those activities?” “

source: སྤྲུལ་པ་ལས་བགྱིད་པར་འགྱུར་རམ།
en: It is, Subhūti!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱེད་དོ། །གསོལ་པ།
en: replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མི་བཞུགས་ན། ཇི་ལྟར་སྤྲུལ་པ་ལས་བགྱིད་པར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Blessed Lord, how will their emanations perform those activities when the tathāgatas are not present?” “

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞི་བའི་བློ་གྲོས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མ་གཟིགས་ནས། དེ་བཞིན་གཤེགས་པའི་སྐུ་སྤྲུལ་ཏེ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །སྤྲུལ་པ་དེས་དེའི་ཕྱི་ན་བསྐལ་པ་གཅིག་ཏུ་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱས་ཏེ། དེའི་རྗེས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུང་བསྟན་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྲགས་ཀྱང་། སྤྲུལ་པ་ལ་སྐྱེ་བ་འམ། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་གང་ཡང་མེད་དོ།
en: Subhūti,” replied the Blessed One, “this is just as a tathāgata, arhat, completely awakened buddha might, with peaceful intelligence, have emanated a tathāgata’s body after observing no bodhisattva present, and then passed into final nirvāṇa, so that the emanation would subsequently perform the deeds of a buddha for an eon, and then, prophesied as a bodhisattva great being, become renowned for attaining final nirvāṇa, and yet in that emanation nothing at all would arise or attain final nirvāṇa!

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུར་ཡིད་ཆེས་པར་བྱས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: It is in this way, Subhūti, that bodhisattva great beings should practice the perfection of wisdom, {Ki.V: 122} confident that all phenomena resemble an emanation.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་སྤྲུལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་ཁྱད་པར་མ་མཆིས་ན། ཡོན་ཕུལ་ན་ཡོངས་སུ་དག་པར་ཇི་ལྟར་འགྱུར།
en: Blessed Lord, if there is no distinction between such an emanation and the tathāgatas, how will donations be purified when they are offered?

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་བསོད་ནམས་འཚལ་བ་དང་། མྱ་ངན་ལས་འདའ་བ་དོན་དུ་གཉེར་བ་འདི་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཡོན་ཕུལ་ན། དེ་ནི་སེམས་ཅན་དེ་དག་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་མ་གྱུར་གྱི་བར་དུ་ནམ་ཡང་བས་པར་མི་འགྱུར་ན།
en: Blessed Lord, when beings who are in search of merit, striving for the sake of nirvāṇa, offer donations to the tathāgatas, arhats, completely awakened buddhas, that [merit] never becomes extinct until those beings have attained final nirvana, in the expanse of nirvāṇa where the psycho-physical aggregates are not left behind.

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ལ་ཡོན་ཕུལ་ན་ཡང་སེམས་ཅན་དེ་དག་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་མ་གྱུར་གྱི་བར་དུ་ནམ་ཡང་བས་པར་མི་འགྱུར་བ་ལགས་སམ།
en: That being the case, Blessed Lord, when they offer donations to an emanation of the tathāgatas, will that [merit] similarly never become extinct until those beings have attained final nirvāṇa, in the expanse of nirvāṇa where the psycho-physical aggregates are not left behind?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་ཉིད་གང་གིས་དེ་བཞིན་གཤེགས་པ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་ཡོན་གྱི་གནས་སུ་གྱུར་པའི་ཆོས་ཉིད་དེ་ཉིད་ཀྱིས། སྤྲུལ་པ་ལ་ཡང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་ཡོན་གྱི་གནས་སོ། །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཕུལ་བ་ལྟ་ཞོག་སྟེ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ལ་ཡོན་ཕུལ་བ་ལྟ་ཡང་ཞོག་གི །
en: Subhūti,” replied the Blessed One, “on the basis of the reality by which the tathāgatas become worthy recipients of the offerings of the world, including the god realms, that emanation also would be a worthy recipient of the offerings of the world, including the god realms.

source: རབ་འབྱོར་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་བྱམས་པ་དང་ལྡན་པར་དེ་བཞིན་གཤེགས་པ་ཡིད་ལ་བྱས་ན་དེ་ཐམས་ཅད་དགེ་བའི་རྩ་བ་དེའི་མཐར་མ་ཕྱིན་པར་སྡུག་བསྔལ་གྱི་མཐར་ཕྱིན་པར་འགྱུར་རོ།
en: Subhūti, leaving aside the offering of donations to the tathāgatas, and leaving aside the offering of donations to that emanation of the tathāgatas, Subhūti, if any noble sons or noble daughters are lovingly focus their attention on the tathāgatas, they will all reach the end of suffering before they reach the end of their roots of virtuous action.

source: །རབ་འབྱོར་བྱམས་པ་དང་ལྡན་པར་ཡིད་ལ་བྱེད་པ་ལྟ་ཞོག་གི །རབ་འབྱོར་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག །དེ་བཞིན་གཤེགས་པ་ཡིད་ལ་བྱས་ཤིང་ནམ་མཁའ་ལ་མེ་ཏོག་འཐོར་ན། དེ་ཐམས་ཅད་ཀྱང་དགེ་བའི་རྩ་བ་དེའི་མཐར་མ་ཕྱིན་པར་སྡུག་བསྔལ་གྱི་མཐར་ཕྱིན་པར་འགྱུར་རོ། །རབ་འབྱོར་བྱམས་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་ལྟ་ཡང་ཞོག་སྟེ།
en: Subhūti, leaving aside those who lovingly focus their attention on them, if, Subhūti, there are any noble sons or noble daughters who scatter flowers in the air while focusing their attention on the tathāgatas, all of these, too, will reach the end of suffering before they reach the end of their roots of virtuous action.

source: ནམ་མཁའ་ལ་མེ་ཏོག་འཐོར་བ་ལྟ་ཡང་ཞོག་གི །རབ་འབྱོར་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་བརྗོད་ན།
en: Subhūti, leaving aside those who who scatter flowers in the air while focusing their attention on the tathāgatas, if, Subhūti, there are any noble sons or noble daughters who say, ‘Homage to the buddhas!’

source: དེ་དག་ཐམས་ཅད་ཀྱང་རིམ་གྱིས་སྡུག་བསྔལ་གྱི་མཐར་ཕྱིན་པར་འགྱུར་ཏེ།
en: all of these, too, will gradually arrive at the end of suffering.

source: རབ་འབྱོར་དེ་ལྟར་དོན་ཆེ་བ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཕུལ་བ་སྟེ། དེ་ལྟ་བུའི་ལེགས་པ་ཆེན་པོ་དང་།
en: In this way, Subhūti, donations offered to the tathāgatas are most advantageous!

source: དེ་ལྟ་བུའི་ཡོན་ཏན་ཆེན་པོ་ཡོད་དོ།
en: They have such excellence, such supreme attributes!

source: །རབ་འབྱོར་རྣམ་གྲངས་དེ་ལྟར་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་བརྩན་པར་བྱས་ན། དེ་བཞིན་གཤེགས་པ་དང་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ལ་བྱེ་བྲག་གང་ཡང་མེད་པར་རིག་པར་བྱ་སྟེ།
en: For such reasons, Subhūti, if one resorts to the reality of all phenomena, one should know that there is no difference at all between the tathāgatas and an emanation of the tathāgatas.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཁོང་དུ་ཆུད་པར་བྱས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་བྱའོ།
en: So it is, Subhūti, that bodhisattva great beings should comprehend the reality of all phenomena and practice the perfection of wisdom. “

source: །ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་ཡང་རྣམ་པར་འཁྲུག་པར་མི་བྱ་སྟེ་འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: This reality of all phenomena will not at all be disturbed.

source: །འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་ཉིད་དོ་ཞེས་རྣམ་པར་དཀྲུག་པར་མི་བྱའོ། །འདི་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: That is to say, it will not be disturbed by the notion that this is the perfection of wisdom, this is the reality of the perfection of wisdom.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །འདི་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་ཉིད་དོ།
en: It will not be disturbed by the notions that this is the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, or the perfection of generosity, this is the reality of the perfection of generosity [and so forth].

source: །ཞེས་རྣམ་པར་དཀྲུག་པར་མི་བྱའོ། །འདི་ནི་ནང་སྟོང་པ་ཉིད་དོ། །འདི་ནི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཆོས་ཉིད་དོ་ཞེས་རྣམ་པར་དཀྲུག་པར་མི་བྱའོ། །འདི་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་རོ།
en: It will not be disturbed by the notions that this is the emptiness of internal phenomena, this is the reality of the emptiness of internal phenomena.

source: །འདི་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཆོས་ཉིད་དོ་ཞེས་རྣམ་པར་དཀྲུག་པར་མི་བྱའོ།
en: It will not be disturbed by the notions that these are [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, this is the reality of the emptiness of the essential nature of nonentities [and so forth].

source: །འདི་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སོ། །འདི་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་ཆོས་ཉིད་དོ། །ཞེས་རྣམ་པར་དཀྲུག་པར་མི་བྱའོ།
en: It will not be disturbed by the notions that this is the applications of mindfulness, this is the reality of the applications of mindfulness.

source: །འདི་ནི་ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའོ། །འདི་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་ཆོས་ཉིད་དོ་ཞེས་རྣམ་པར་དཀྲུག་པར་མི་བྱའོ།
en: It will not be disturbed by the notions that these are the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, this is the reality of the noble eightfold path [and so forth].

source: །འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་རོ། །འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་ཆོས་ཉིད་དོ་ཞེས་རྣམ་པར་དཀྲུག་པར་མི་བྱའོ།
en: It will not be disturbed by the notions that these are [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, this is the reality of the distinct qualities of the buddhas [and so forth].

source: །འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ། །འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཉིད་དོ་ཞེས་རྣམ་པར་དཀྲུག་པར་མི་བྱའོ། །གསོལ་པ།
en: It will not be disturbed by the notions that this is all-aspect omniscience, this is the reality of all-aspect omniscience.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་རྣམ་པར་དཀྲུག་པར་མི་བགྱི་བ་ལགས་ན། དེ་ལ་དེ་བཞིན་གཤེགས་པས་འདི་ནི་གཟུགས་སོ། །འདི་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའོ། །འདི་ནི་སྐྱེ་མཆེད་དོ། །འདི་ནི་ཁམས་སོ།
en: Blessed Lord, if the reality of all phenomena should not become disturbed, has the reality of all phenomena not been purposefully disturbed by the Blessed One when he disturbed it with the notions that these are physical forms; these are feelings, {Ki.

source: །འདི་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའོ། །འདི་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་སོ། །འདི་ནི་སྟོང་པ་ཉིད་རྣམས་སོ། །འདི་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སོ། །འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་རོ། །འདི་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རོ་ཞེས་རྣམ་པར་དཀྲུག་པ་མཛད་ན།
en: V: 123} perceptions, formative predispositions, and consciousness; these are the sense fields; these are the sensory elements; these are the links of dependent origination; these are the perfections; these are the aspects of emptiness; these are the factors conducive to enlightenment; these are [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas; and these are [the goals], up to and including all-aspect omniscience?” “

source: དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་རྣམ་པར་དཀྲུགས་པར་མ་གྱུར་ཏམ།
en: Subhūti, that is not the case!”

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ཏེ། ངས་ཇི་ལྟར་ན་གཞན་རྣམས་ཁོང་དུ་ཆུད་པར་འགྱུར་ཞེས་མིང་དང་མཚན་མས་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་བསྟན་ཏེ་ཆོས་རྣམས་བརྗོད་ཀྱི། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་རྣམ་པར་དཀྲུག་པ་མེད་དོ།
en: I have revealed the reality of all phenomena and proclaimed [the nature of] all phenomena through names and signs, in such a way that others might comprehend it, but the reality of all phenomena is undisturbed.” “
